Tekla Open API Reference for Tekla Structures 2025
LogicalWeld Properties
The LogicalWeld type exposes the following members.
Properties
Name | Description
AdditionalSizeAbove
 Gets or sets the additional size above for combination welds.
 (Inherited from BaseWeld.)
AdditionalSizeBelow
 Gets or sets the additional size below for combination welds.
 (Inherited from BaseWeld.)
AngleAbove
 Gets or sets the angle above.
 (Inherited from BaseWeld.)
AngleBelow
 Gets or sets the angle below.
 (Inherited from BaseWeld.)
AroundWeld
 Gets or sets a value indicating whether the weld is an around weld (true) or an edge weld (false).
 (Inherited from BaseWeld.)
ConnectAssemblies
 Gets or sets a value indicating whether to connect a part or an assembly as a secondary part (false) or as a sub-assembly (true).
 (Inherited from BaseWeld.)
ContourAbove
 Gets or sets the contour above.
 (Inherited from BaseWeld.)
ContourBelow
 Gets or sets the contour below.
 (Inherited from BaseWeld.)
EffectiveThroatAbove
 Gets or sets the effective throat above.
 (Inherited from BaseWeld.)
EffectiveThroatBelow
 Gets or sets the effective throat below.
 (Inherited from BaseWeld.)
ElectrodeClassification
 Gets or sets the weld electrode classification.
 (Inherited from BaseWeld.)
ElectrodeCoefficient
 Gets or sets the electrode strength coefficient.
 (Inherited from BaseWeld.)
ElectrodeStrength
 Gets or sets the electrode strength.
 (Inherited from BaseWeld.)
FinishAbove
 Gets or sets the finish above.
 (Inherited from BaseWeld.)
FinishBelow
 Gets or sets the finish below.
 (Inherited from BaseWeld.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IncrementAmountAbove
 Gets or sets the increment amount above.
 (Inherited from BaseWeld.)
IncrementAmountBelow
 Gets or sets the increment amount below.
 (Inherited from BaseWeld.)
IntermittentType
 Gets or sets the weld intermittent type.
 (Inherited from BaseWeld.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LengthAbove
 Gets or sets the length above.
 (Inherited from BaseWeld.)
LengthBelow
 Gets or sets the length below.
 (Inherited from BaseWeld.)
MainObject
 Gets or sets the main part of the weld.
 (Inherited from BaseWeld.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
NDTInspection
 Gets or sets the NDT inspection level.
 (Inherited from BaseWeld.)
PitchAbove
 Gets or sets the pitch above.
 (Inherited from BaseWeld.)
PitchBelow
 Gets or sets the pitch below.
 (Inherited from BaseWeld.)
Placement
 Gets or sets the weld placement.
 (Inherited from BaseWeld.)
PrefixAboveLine
 Gets or sets the size prefix above the line.
 (Inherited from BaseWeld.)
PrefixBelowLine
 Gets or sets the size prefix below the line.
 (Inherited from BaseWeld.)
Preparation
 Gets or sets the weld preparation.
 (Inherited from BaseWeld.)
ProcessType
 Gets or sets the process type.
 (Inherited from BaseWeld.)
ReferenceText
 Gets or sets the reference text.
 (Inherited from BaseWeld.)
RootFaceAbove
 Gets or sets the root face above.
 (Inherited from BaseWeld.)
RootFaceBelow
 Gets or sets the root face below.
 (Inherited from BaseWeld.)
RootOpeningAbove
 Gets or sets the root opening above.
 (Inherited from BaseWeld.)
RootOpeningBelow
 Gets or sets the root opening below.
 (Inherited from BaseWeld.)
SecondaryObject
 Gets or sets the secondary part of the weld.
 (Inherited from BaseWeld.)
ShopWeld
 Gets or sets a value indicating whether the weld is a shop weld (true) or a site weld (false).
 (Inherited from BaseWeld.)
SizeAbove
 Gets or sets the size above.
 (Inherited from BaseWeld.)
SizeBelow
 Gets or sets the size below.
 (Inherited from BaseWeld.)
Standard |  Obsolete.
 Gets or sets the weld detail/standard.
 (Inherited from BaseWeld.)
StitchWeld |  Obsolete.
 Gets or sets a value indicating whether the weld is stitched (true) or not stitched (false).
 (Inherited from BaseWeld.)
TypeAbove
 Gets or sets the type above.
 (Inherited from BaseWeld.)
TypeBelow
 Gets or sets the type below.
 (Inherited from BaseWeld.)
WeldNumber
 Gets the weld number.
 (Inherited from BaseWeld.)
WeldNumberPrefix
 Gets or sets the weld number prefix.
 (Inherited from BaseWeld.)
Top
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace